Tekla Open API Reference for Tekla Structures 2025
Part.GetSolid Method (Solid.SolidCreationTypeEnum)
 Returns the solid of the part.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Solid GetSolid(
	Solid.SolidCreationTypeEnum solidCreationType
)
Public Function GetSolid (
	solidCreationType As Solid.SolidCreationTypeEnum
) As Solid
Parameters
solidCreationType
Type: Tekla.Structures.Model.Solid.SolidCreationTypeEnum
The type to be used in solid creation.
Return Value
Type: Solid
The solid of the part.
See Also
Reference
Part Class
GetSolid Overload
Tekla.Structures.Model Namespace